# პირობითი ოპერატორები გამოიყენება მაშინ როცა პროგრამამ უნდა გადაწყვიტოს  რა გააკეთოს სხვადასხვა სიტუაციაში.ამოწმებს პირობას და მოქმედებს იმის მიხედვით არის True თუ False
# ლოგიკური ოპერატორები აკავშირებს რამდენიმე პირობას და პროგრამას აძლვს საშუალებას,ერთდროულად შეამოწმოს რამოდენიმე პირობა.ისინი გამოიყენება რომ საბოლოოდ მივიღოთ მართალია(True) თუ მცდარია(False).

#num
num=int(input("Enter any number:"))
if num > 0 and num % 2 == 0: 
    print("number is positive and double")
else:
    print("condition failed")


