// 1) App.jsx - ში შექმენით movies მასივი სადაც შეინახავთ ფილმებს 5 კუთვნილებით id, name, description, rating, image,
//  თქვენი დავალებაა, რომ Movies კომპონენტს props - ად გადასცეთ movies მასივი, Movies - კომპონენტში props - ის სახით 
// მიიღეთ movies მასივი, შემდეგ კი მასივში არსებული ფილმები სათითაოდ დაა - render - ეთ (გამოიტანეთ ეკრანზე), ასევე უნდა
//  გქონდეთ ცალკე Movie კომპონენტი სადაც გამოტანილი იქნება კონკრეტული ფილმის შესახებ ინფორმაცია, Movie კომპონენტს 
// props - ად გადაეცით id, რომლის დახმარებით movies მასივში გადმოცემული id - ის მიხედვით კონკეტულ ფილმს იპოვით და საიტზე 
// მის ინფორმაციას გამოიტანთ (Movie კომპონენტს props - ად id მნიშვნელობა უნდა გადასცეთ Movies კომპონენტიდან,
//  მინიშნება - მაშინ როდესაც საიტზე ფილმები გამოგაქვთ)
// ამ დავალების გასაკეთებლად გამოიყენეთ props, დაწერილი კოდები კი ახსენით კომენტარების სახით და კარგად გაიაზრეთ

