#მონაცემთა სტრუქტურა პროგრამირებაში არის სპეციალური ხერხი, რომლითაც მონაცემებს ვაწყობთ და ვინახავთ კომპიუტერში.
#სია არის არის მონამცემთა სტრუქტურაგვეხმარებიან რომ შევქმნათ ერთი ცვლადი ნაცვლად ბევრის და შევინახოთ მასში ბვრი მონაცემთა ტიპი
#გვეხმარებიან რომ შევქმნათ ერთი ცვლადი ნაცვლად ბევრის და შევინახოთ მასში ბვრი მონაცემთა ტიპი
#ვწერთ ცვლადს ვუტოლბთ კვადრატულ ფრჩხილებს,ვწერთ მასში ელემენტებს აუცილბლად ვყოფთ მძიმეებით

me = [ "Salome" , "Giorgadze" , 16 , 1.70 , "Dancer" , "GOA Student"]
print(me[0:6])

print(me[0])
print(me[1])
print(me[2])
print(me[3])
print(me[4])
print(me[5])

print(me[-1])