// 2) კომენტარების სახით App.jsx - ის ფაილში ახსენით თუ რა არის კომპონენტი, რატომ არის კომპონენტების გამოყენება კარგი პრაქტიკა

// კომპონენტები არის დამოუკიდებელი ნაწილები და უფრო მარტივი გასაგები,მოწესრიგებულია ,ბევრჯერ გამოყენებადია

// 3) შექმენით კომპონენტი სახელად ShowSecretMessage - რომელიც if statement - ის გამოყენებით ამოწმებს ცვლადის მნიშვნელობას, 
// იმ შემთხვევაში თუ showSecretMessage ცვლადის მნიშვნელობა უდრის true - ს მაშინ გამოიტანეთ ტექსტი მაგალითად 
// "This is a secret message" სხვა შემთხვევაში კი გამოიტანეთ ღილაკი და მასზე დაჭერისას შეცვალეთ showSecretMessage ცვლადის 
// მნიშვნელობა ისე, რომ ის false - დან გადავიდეს true მნიშვნელობაში, საბოლოოდ კი მოცემული კოპონენტი გაიტანეთ ფაილიდან და 
// დააიმპორტეთ App მთავარ ფაილში

// 5) შექმენით კომპონენტი სახეხლად CheckUserAge, რომელშიც შექმენით ცვლადს სახელად  age - მასში შეინახეთ თქვენი ასაკი, 
// შემდეგ კი შეამოწმეთ იმ შემთხვევაში თუ age - ცვლადის მნიშვნელობა ინახავს 18 - ს ან 18 - ზე მეტ რიცხვს გამოიტანეთ ტექსტი 
// 'You are an adult' სხვა შემთხვევაში კი 'You are a kid' მოცემული კომპონენტი დაა - export - ეთ და დააიმპორტეთ App.jsx - ის
//  ფაილში

// 4) შექმენით კომპონენტი სახელად Box რომელიც არნდერებს div - ს, მოცემულ div - ს გაუწერეთ ატრიბუტები როგორიცაა width, 
// height - თქვენი დავალებაა, რომ შექმნათ ისეთი ფუნქცია რომელიც random - ულად აურჩევს მოცემულ div - ს უკანა ფერს 
// (მოიძიეთ ინფორმაცია იმაზე თუ როგორ უნდა შეუცვალოთ რაიმე ელემენტს უკანა ფერი) შემდეგ კი Box კომპონენტი ფაილიდან გაიტანეთ
//  და App.jsx - ის ფაილში 2 - ჯერ გამოიძახეთ, კომპონენტის გამოძახებისას შეიცვალა თუ არა თქვენს მიერ გაწერილი div - ის 
// უკანა ფერი, კომენტარების სახით ახსენით თქვენს მიერ დაწერილი კოდი
