// relational მონაცემღა ბაზებში ინახება მონაცემები ცხრილებში,რომელიც არის სტრუქტურული ანუ აქვს რიგები და სვეტები,ასევე მათ აქვთ წინასწარგანსაზღვრული სტრუქტურა
// non-relational - ში მონაცემები არ ინახება ცხრილების ფორმატში,არის key-value,graphic ან document ტიპის

// relational --> MySQL
// non-relational --> MongoDB


// web API არის საშუალენა რომ ერთი პროგრამა დაუკავშირდესმეორე პროგრამას ინტერნეტის საშუალებით და მიიღოს ან გააგზავნოს მონაცემები,გამოიყენება მონაცემების წამოღებისთვის,მონაცემების გასაგზავნად
// Internal API გამოიყენება მხოლოდ ერთი სისტემის შიგნით და არ არის ხელმისაწვდომი გარედან 

// Public API  ხელმისაწვდომია ყველასთვის დეველოპერებისთვის გამოიყენება გარე აპლიკაციებში დასაკავშირებლად

