// სტატიკური პარამეტრი არის მნიშვნელობა, რომელიც არ იცვლება
// ანუ წინასწარ არის გაწერილი და ყოველთვის ერთი და იგივეა

// დინამიური პარამეტრი არის მნიშვნელობა, რომელიც იცვლება
// მომხმარებლის მოქმედებაზე, input-ზე ან სხვა მონაცემებზე დაყრდნობით

// localStorage გამოიყენება მონაცემების ბრაუზერში შესანახად
// მონაცემის შენახვა
localStorage.setItem("city", "Tbilisi");
// მონაცემის წამოღება
const city = localStorage.getItem("city");
// კონსოლში გამოჩნდება Tbilisi
console.log(city);
// მონაცემის წაშლა
localStorage.removeItem("city");

