// შეეცადეთ და შექმენით პროექტი, სადაც გექნდებათ სამი ძირითადი კომპონენტი Products, Product, Cart, App.jsx - ის ფაილში
//  შექმენით პროდუქტების მასივი მინიმუმ 5 პროდუქტის ობიექტით, მოცემული მასივი props - ად გადაეცით Products კომპონენტს 
// გამოძახებისას, Products კომპონენტში მიიღეთ props - ად გადმოცემული products - მასივი, გადაუარეთ მას .map მეთოდის 
// გამოყენებით და თითოეული პროდუქტისთვის გამოიძახეთ Product კომპონენტი რომელსაც props - ად გადასცემთ ამჟამიდელი პროდუქტის 
// ობიექტს და handleAdd ფუნქციას (რომელსაც მოგვიანებით დაამატებთ App.jsx - ის ფაილში), Product - კომპონენტში მიიღეთ 
// props - ად გადმოცემული პროდუქტის ობიექტი, რომელის ინფორმაციასაც საიტზე დაარენდერებთ, თითოეულ პროდუქტს საიტზე უნდა 
// ჰქონდეს ღილაკი add to cart - როდესაც მოცემულ ღილაკს დავაჭრთ ხელს უნდა გამოვიძახოთ handleAdd ფუნქცია რომელიც გადმოგვეცა 
// Products კომპონენტიდან, ამისათვის App კომპონტენტში შექმნით მდგომარეობა cart რომლის საწყისი მნიშვნელობა ცარიელი მასივის 
// ტოლია, App კომპონენტში არსებულმა handleAdd ფუნქციამ პარამეტრად უნდა მიიღოს პროდუქტის ობიექტი რომელსაც cart მასივში წინა
//  ელემენტებთან ერთად ჩაამატებს, შემდეგ კი მოცემული handleAdd ფუნქცია props - ად გადაეცით Products კომპონენტს, cart
//  მდგომარეობა კი Cart კომპონენტს, Cart კომპონენტმა გადმოცემული cart - ი უნდა მიიღოს props - ად, და კალათის ინფორმაცია 
// საიტზე გამოიტანოს, ყველაფერი ახსენით დეტალურად კომენტარების სახით, და კარგად გაიაზრეთ თქვენს მიერ დაწერილი კოდი, თუ 
// თქვენთვის რაიმე იქნება გაუგებარი შეგიძლიათ მოიძიოთ ინფორმაცია

// App კომპონენტში - უნდა გამოიძახოთ Products, Cart კომპონენტები შესაბამისი props - ებით

// Products კომპონენტში - უნდა გამოიძახოთ Product კომპონენტი შესაბამისი props - ებით


