# ცვლადი არის სახელი რომლითაც ვასახელებთ მონაცემს რომ შემდგომში გამოვიყნოთ
# მონაცემთა ტიპი არის კატეგორია რომელიც აღნიშნავს რა სახის მონაცემი გვაქვს ცვლადში.String(ტექსტი),Integer(მთელი რიცხვი),Float(ათწილადი),Boolean(True და False)
# ტერმინალი არის სპეციალური ფანჯარა,სადაც შეგვიძლია პროგრამას მივაწოდო ინსტრუქცია და ვნახოთ პასუხი პირდაპირ.
# Print() ფუნქცია არის პითონში,რომელიც ბეჭდავს ინფორმაციას ეკრანზე.თუ () არ დაეწერება პროგრამა ვერ მიხვდება რა უნდა დაბეჭდოს
# სინტაქსი ნიშნავს წერის წესებს პროგრამირებაში
# კომენტარი არის ტექსტი კოდში რომელსაც პროგრამა ყურადღებას არ აქცევს,არ ასრულებს, მას ვიყენებთ კოდის ახსნისთვის

# 1name=Salome
# your name=Salome   (Space)
#name!=Salome     (გარდა Snake Case)
# if = 11      (Keywords)
# str() 
age = 17
age_str=str(age)
print(age_str)

# str არის ტექსტი რომელიც იწრება ბრჭყალბში 
# name = "Salome"
# name = 'Salome'
# name= """Salome"""

# Boolean(True და False)
# Input() ფუნქცია არის რომელიც მომხმარებელს სთხოვს ინფორმაციის ჩაწერას
# სტრინგად

num1 = int(input("Enter number:"))
num2 = int(input("Enter second number:"))
print("the answer is:", num1 + num2)

# Low-Level ენები ყველაზე ახლოს არიან კომპიუტერის ენასთან (machine code) ნულბი და ერთბი.
# High-level პროგრამირების ენები ესენია ენები, რომლებიც ადამიანისთვის უფრო მარტივად წასაკითხი და გასაგებია. 
# იმიტომ რომ low-level ენები მუშაობენ უშუალოდ აპარატურასთან, ანუ მათ არ სჭირდებათ დამატებითი თარგმნა ან ინტერპრეტაცია.
# პირობითი ოპერატორები გამოიყენება მაშინ როცა პროგრამამ უნდა გადაწყვიტოს  რა გააკეთოს სხვადასხვა სიტუაციაში.ამოწმებს პირობას და მოქმედებს იმის მიხედვით არის True თუ False
# ლოგიკური ოპერატორები აკავშირებს რამდენიმე პირობას და პროგრამას აძლვს საშუალებას,ერთდროულად შეამოწმოს რამოდენიმე პირობა.ისინი გამოიყენება რომ საბოლოოდ მივიღოთ მართალია(True) თუ მცდარია(False).
# if-else statement გამოიყენება გადაწყვეტილებების მისაღებად პროგრამაში.Statement-ინსტრიქცია,განცხადება
# if ნაწილი როცა პირობა სიმართლეა (True), Else ნაწილი როცა პირობა არასწორია (False)


