// 2) შექმენით ფაილი, სადაც დაწერთ რაიმე კოდს, terminal - იდან node - ის დახმარებით კი გაუშვით კოდი და ნახეთ შედეგი, ამასთანავე node - ის terminal - ში გაშვებისას გადაეცით ორი არგუმენტი (რიცხვი) მაგალითად 3 და 5, შემდეგ კი argv - მასივიდან ამოიღეთ თქვენს მიერ ჩამატებული რიცხვები და მათზე ჩაატარეთ მათემატიკური ოპერაციები, როგორიცაა (მიმატება, გამოკლება, გამრავლება, გაყოფა), ამისათვის გამოიყენეთ process - ის შესაბამისი კუთვნილება

console.log(parseInt(process.argv[2]) + parseInt(process.argv[3]))
console.log(parseInt(process.argv[2]) - parseInt(process.argv[3]))
console.log(parseInt(process.argv[2]) * parseInt(process.argv[3]))
console.log(parseInt(process.argv[2]) / parseInt(process.argv[3]))

// 3) კომენტარების სახით ახსენით თუ როგორ შეგვიძლია node.js - ში რაიმე package - ის და - import - ება, მოიყვანეთ მაგალითიც

// node.js - ში იმპორტისთვის ვიყენებთ require - ს
const os = require('os');

// 4) გამოიყენეთ process - ის global ობიექტის თქვენთვის ცნობილი მეთოდები და კუთვნილებები როგორიცაა (uptime(), cwd(), argv, env და ა.შ.) თითოეულის დანიშნულება ახსენით კომენტარების სახით
// process.argv გვიბრუნებს მასივს სადაც პირველი ელემენტი არის node.js address ხოლო მეორე კი ჩვენი ფოლდერის მისამართი
console.log(process.argv)
// process.env არის ობიექტი რომელიც ინახავს ინფორმაციას ამ კონკრეტული გარემოს შესახებ სადაც ეშვება ამჟამინდელი პროგრამა
console.log(process.env)
// property PWD ინახავს ინფორმაციას თუ რომელ ფოლდერში იყო მოთავსებული ჩვენი ფაილი, რითიც გავუშვით პროგრამა
console.log(process.PWD)

// 5) დღევანდელ გაკვეთილზე ნასწავლი os module - ის დანიშნულება ახსენით კომენტარების სახით, შემდეგ კი გამოიყენეთ დღევანდელ გაკვეთილზე ნასწავლი os - ის მეთოდები როგორიცაა (type, arch, networkInterfaces, homedir, hostname, uptime), ახსენით თითოეულის დანიშნულება კომენტარების სახით, დამატებით მოიძიეთ ინფორმაცია os - ის ხშირად გამოყენებად მეთოდებზე და გააკეთეთ მათზეც რამოდენიმე მაგალითი
// os მოდული გვაძლევს ინფორმაციას ოპერაციული სისტემის შესახებ

// ოპერაციული სისტემის ტიპს
console.log('operationg system',os.type())
// გვიჩვენებს პროცესორის არქიტექტურას
console.log('CPU arch',os.arch())
// აბრუნებს ყველა ქსელურ ინტერფეისს (ინტერნეტ კავშირები)
console.log('Network',os.networkInterfaces())
// გვაძლევს მომხმარებლის home დირექტორიას
console.log('Homedir',os.homedir())
// კომპიუტერის სახელი (network name)
console.log('Hostname',os.hostname())
// გიჩვენებს რამდენი წამია სისტემა ჩართული
console.log('uptime',os.uptime())

// 6) node - ს ტერმინალიდან გადაეცით ფაილის სახელი სადაც გიწერიათ კოდი და რაიმე რიცხვი მაგალითად 400, ფაილში თქვენი დაწერილი კოდის დანიშნულება იქნება, ის, რომ შეამოწმოს არგუმენტების სიაში არსებული რიცხვი (ამ შემთხვევაში 400), თუ არგუმენტების მასივში არსებული რიცხვი მეტია თავისუფალ მეხსიერებაზე, მაშინ გამოიტანეთ warning - 'Not enough memory' სხვა შემთხვევაში კი 'Enough memory', გამოიყენეთ process - ის შესაბამისი მეთოდი და კუთვნილება, ახალი მეთოდის მოძიების შემდეგ, მისი დანიშნულება ახსენით კომენტარების სახით
// მინიშნება (process - ის, ის მეთოდი რომელსაც თქვენ მოიძიებთ და გამოიყენებთ, ის თავისუფალ მეხსიერებას აბრუნებს bytes - ბიტებში)

// process.argv -> აბრუნებს ტერმინალიდან გადაცემულ არგუმენტებს მასივის სახით
// [0] არის node-ის გზა
// [1] არის ფაილის სახელი
// [2] არის ჩვენთვის საჭირო მნიშვნელობა

const input = parseInt(process.argv[2])

// process.memoryUsage() აბრუნებს ობიექტს, სადაც მოცემულია Node.js-ის მიერ გამოყენებული მეხსიერება ბიტებში
// os.freemem() აბრუნებს სისტემის თავისუფალ მეხსიერებას bytes-ში

const freeMemory = os.freemem();

if (input > freeMemory){
    console.log('not enough memory')
} else {
    console.log('enough memory')
}