# Flow-chart არის სურათი, სადაც ნაჩვენებია, როგორ უნდა იმუშაოს ალგორითმა ნაბიჯ-ნაბიჯ
# Iteration  გულისხმობს როდესაც მოქმედება არის განმეორებადი და თუ რამდენჯერ განმეორდება,Sequence ნიშნავს როდესაც  გაწერილი-მოქმედებები თანმიმვდევრობით მიყვება,Selection ნიშნავს როდესაც მოქმედება დაფუძვნებული არის კონდინციაზე
# Range არის პითონის ფუნქცია და ქმნის რიცხვების მიმდვრობას
# არის წინასწარ დაგეგმილი ნაბიჯები ან ინსტრუქციები, რომელიც გვეუბნება , რა გზით უნდა მივაღწიოთ მიზანს ან როგორ უნდა შევასრულოთ კონკრეტული დავალება